zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
/*
 * NOTE: File generated by lpc_cfg_utils.py
 * from LPC55S69JBD100/signal_configuration.xml
 *
 * Copyright (c) 2022, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_LPC55S69JBD100_
#define _ZEPHYR_DTS_BINDING_LPC55S69JBD100_

#define IOCON_MUX(port, pin, type, mux)		\
	(((((port)) & 0x3) << 30) |		\
	(((pin) & 0x3F) << 24) |		\
	(((type) & 0x3) << 22) |		\
	(((mux) & 0xF) << 0))

#define IOCON_TYPE_D 0x0
#define IOCON_TYPE_I 0x1
#define IOCON_TYPE_A 0x2

#define DMA03_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define PINT4_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define SECPINT1_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 10) /* PIO0_0 */
#define DMA12_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define PINT7_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA13_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define SCT02_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 4) /* PIO0_0 */
#define DMA018_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA020_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA022_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA16_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define PINT6_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define PINT0_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA07_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA014_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define FC3_SCK_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 2) /* PIO0_0 */
#define DMA021_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA17_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA012_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define GPIO0_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define PINT1_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define SECPINT0_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 10) /* PIO0_0 */
#define SECGPIO0_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 10) /* PIO0_0 */
#define DMA015_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA06_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA013_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA010_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA08_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define SCT06_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 4) /* PIO0_0 */
#define DMA05_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define PINT5_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define SCT01_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 4) /* PIO0_0 */
#define SCT00_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 4) /* PIO0_0 */
#define DMA09_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA00_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define SCT03_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 4) /* PIO0_0 */
#define SD1_CARD_INT_N_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 6) /* PIO0_0 */
#define DMA15_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define SCT05_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 4) /* PIO0_0 */
#define DMA18_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA019_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA19_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA011_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define PINT3_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA10_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA14_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA01_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA04_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA017_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define PMC1_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define CTIMER00_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 3) /* PIO0_0 */
#define DMA11_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA016_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define DMA02_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define PINT2_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 0) /* PIO0_0 */
#define SCT04_PIO0_0 IOCON_MUX(0, 0, IOCON_TYPE_A, 4) /* PIO0_0 */
#define CTIMER03_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define CTIMER02_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define SCT03_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 4) /* PIO0_1 */
#define CTIMER43_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define DMA021_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define CMP0_OUT_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 7) /* PIO0_1 */
#define SCT02_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 4) /* PIO0_1 */
#define DMA05_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA012_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define SCT00_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 4) /* PIO0_1 */
#define DMA06_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA022_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA010_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA18_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define SCT06_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 4) /* PIO0_1 */
#define CTIMER10_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define CTIMER32_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define DMA016_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define CTIMER41_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define DMA00_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define SD1_CLK_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 6) /* PIO0_1 */
#define DMA019_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA03_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA018_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define PINT5_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define SECPINT0_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 10) /* PIO0_1 */
#define SECGPIO1_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 10) /* PIO0_1 */
#define DMA13_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA013_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define PINT4_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA09_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define CTIMER13_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define CTIMER11_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define CTIMER31_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define CTIMER33_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define SCT05_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 4) /* PIO0_1 */
#define DMA14_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define PINT2_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define CTIMER40_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define SCT01_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 4) /* PIO0_1 */
#define CTIMER23_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define CTIMER21_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define PINT7_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA12_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define CTIMER22_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define CTIMER01_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define PINT3_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA19_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA014_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define PINT6_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define GPIO1_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define FC3_CTS_SDA_SSEL0_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 2) /* PIO0_1 */
#define DMA020_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA02_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA17_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA04_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA017_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA011_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define PINT1_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA01_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define CTIMER30_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define CTIMER42_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define DMA015_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define SECPINT1_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 10) /* PIO0_1 */
#define CTIMER00_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define DMA10_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define SCT04_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 4) /* PIO0_1 */
#define DMA16_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA15_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA07_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA08_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define DMA11_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define PINT0_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 0) /* PIO0_1 */
#define CTIMER20_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define CTIMER12_PIO0_1 IOCON_MUX(0, 1, IOCON_TYPE_D, 3) /* PIO0_1 */
#define DMA013_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA017_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA01_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA06_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA10_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define PINT5_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER00_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA16_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER21_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA015_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define ADC01_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER33_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA08_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER32_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define SECGPIO10_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 10) /* PIO0_10 */
#define SECPINT0_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 10) /* PIO0_10 */
#define FC6_SCK_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 1) /* PIO0_10 */
#define DMA07_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER43_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define CTIMER31_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define GPIO10_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA17_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA09_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA12_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define SCT02_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 5) /* PIO0_10 */
#define PINT1_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER41_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA021_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER22_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA019_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER30_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define FC1_TXD_SCL_MISO_WS_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 4) /* PIO0_10 */
#define DMA18_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA00_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define PINT3_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA14_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA012_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define SWO_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 6) /* PIO0_10 */
#define CTIMER02_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA010_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA022_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER12_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define CTIMER20_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 3) /* PIO0_10 */
#define CTIMER42_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA018_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER20_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA020_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA011_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER40_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define PINT0_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER13_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define CTIMER01_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA11_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA03_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA04_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA014_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER10_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define CTIMER03_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA15_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define PINT4_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define PINT6_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define PINT7_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER23_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA02_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA13_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define CTIMER11_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 2) /* PIO0_10 */
#define DMA016_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define SECPINT1_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 10) /* PIO0_10 */
#define PINT2_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA05_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define DMA19_PIO0_10 IOCON_MUX(0, 10, IOCON_TYPE_A, 0) /* PIO0_10 */
#define PINT6_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA13_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA014_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA09_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA16_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA010_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define SECPINT0_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 10) /* PIO0_11 */
#define DMA01_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA020_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA06_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define PINT5_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA05_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define PINT2_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define CTIMER22_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 2) /* PIO0_11 */
#define PINT0_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA012_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA017_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define PINT3_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define ADC09_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA18_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA04_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define SWCLK_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 6) /* PIO0_11 */
#define DMA015_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA15_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA02_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA03_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define FC6_RXD_SDA_MOSI_DATA_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 1) /* PIO0_11 */
#define DMA10_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA08_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define SECGPIO11_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 10) /* PIO0_11 */
#define DMA00_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define SECPINT1_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 10) /* PIO0_11 */
#define DMA19_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA016_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA022_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define PINT1_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define PINT7_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA11_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA011_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA018_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA07_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA12_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA17_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA013_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define SYSCONA_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 3) /* PIO0_11 */
#define DMA021_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA019_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define PINT4_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define GPIO11_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA14_PIO0_11 IOCON_MUX(0, 11, IOCON_TYPE_A, 0) /* PIO0_11 */
#define DMA11_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA01_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA020_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define PINT7_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SCT04_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 4) /* PIO0_12 */
#define DMA018_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA06_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SYSCONB_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 3) /* PIO0_12 */
#define PINT4_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SCT05_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 4) /* PIO0_12 */
#define DMA17_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA012_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA013_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA022_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA13_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA16_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA010_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA19_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA015_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SWDIO_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 6) /* PIO0_12 */
#define DMA016_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SCT00_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 4) /* PIO0_12 */
#define DMA09_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SCT06_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 4) /* PIO0_12 */
#define SECPINT1_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 10) /* PIO0_12 */
#define DMA14_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA017_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define FC6_TXD_SCL_MISO_WS_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 7) /* PIO0_12 */
#define DMA15_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA04_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA05_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SECPINT0_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 10) /* PIO0_12 */
#define SD1_BACKEND_PWR_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 2) /* PIO0_12 */
#define DMA02_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SCT03_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 4) /* PIO0_12 */
#define PINT3_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA07_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA10_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define PINT0_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA021_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SECGPIO12_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 10) /* PIO0_12 */
#define DMA08_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define PINT5_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA18_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA019_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SCT02_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 4) /* PIO0_12 */
#define DMA12_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define PINT6_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA014_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define FC3_TXD_SCL_MISO_WS_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 1) /* PIO0_12 */
#define DMA03_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define ADC010_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SD0_POW_EN_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 5) /* PIO0_12 */
#define GPIO12_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define SCT01_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 4) /* PIO0_12 */
#define DMA011_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define PINT1_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA00_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define PINT2_PIO0_12 IOCON_MUX(0, 12, IOCON_TYPE_A, 0) /* PIO0_12 */
#define DMA17_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define CTIMER30_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define PINT0_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define SCT03_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 4) /* PIO0_13 */
#define DMA15_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define UTICK00_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 2) /* PIO0_13 */
#define SCT02_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 4) /* PIO0_13 */
#define DMA18_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA02_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define FC1_RXD_SDA_MOSI_DATA_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 5) /* PIO0_13 */
#define DMA11_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define PINT3_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define PINT1_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define SCT04_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 4) /* PIO0_13 */
#define DMA01_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define CTIMER02_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define PINT7_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define CTIMER42_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define CTIMER20_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define DMA19_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define GPIO13_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define SCT05_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 4) /* PIO0_13 */
#define DMA021_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define PINT2_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
