zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
#define DMA020_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA08_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define SECPINT0_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 10) /* PIO0_13 */
#define DMA018_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA014_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define PLU0_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 9) /* PIO0_13 */
#define PINT5_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define CTIMER31_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define DMA16_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA03_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA09_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define FC1_CTS_SDA_SSEL0_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 1) /* PIO0_13 */
#define DMA015_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA016_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA12_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA00_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA022_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA010_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA04_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define CTIMER43_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define DMA019_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define PINT6_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA10_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define SCT00_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 4) /* PIO0_13 */
#define SECGPIO13_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 10) /* PIO0_13 */
#define CTIMER40_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define CTIMER22_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define CTIMER12_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define SCT01_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 4) /* PIO0_13 */
#define CTIMER33_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define DMA011_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define PINT4_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA06_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA13_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define SECPINT1_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 10) /* PIO0_13 */
#define CTIMER10_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define CTIMER03_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define CTIMER23_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define CTIMER11_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define DMA013_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define CTIMER13_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define CTIMER32_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define DMA05_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define CTIMER21_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define DMA14_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define CTIMER01_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define DMA017_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define CTIMER41_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define SCT06_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 4) /* PIO0_13 */
#define CTIMER00_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 3) /* PIO0_13 */
#define DMA012_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA07_PIO0_13 IOCON_MUX(0, 13, IOCON_TYPE_I, 0) /* PIO0_13 */
#define DMA16_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA11_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA01_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA05_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define PINT3_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define PINT2_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER11_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define CTIMER02_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA02_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define SCT05_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 4) /* PIO0_14 */
#define CTIMER03_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA011_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA022_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER30_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define SCT00_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 4) /* PIO0_14 */
#define FC1_RTS_SCL_SSEL1_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 1) /* PIO0_14 */
#define SECPINT1_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 10) /* PIO0_14 */
#define CTIMER12_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define PINT1_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define PINT4_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER20_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define CTIMER32_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA17_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA016_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA010_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define PINT0_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define FC1_TXD_SCL_MISO_WS_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 6) /* PIO0_14 */
#define GPIO14_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define SCT02_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 4) /* PIO0_14 */
#define CTIMER31_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define CTIMER13_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA07_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER22_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA19_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA021_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA018_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define SCT06_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 4) /* PIO0_14 */
#define SCT04_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 4) /* PIO0_14 */
#define SCT03_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 4) /* PIO0_14 */
#define CTIMER10_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA06_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER40_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA017_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA015_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA020_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER21_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA18_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER41_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define PINT6_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA12_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA019_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA14_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA13_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER43_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA10_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA09_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define SECGPIO14_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 10) /* PIO0_14 */
#define PINT7_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define SECPINT0_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 10) /* PIO0_14 */
#define PLU1_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 9) /* PIO0_14 */
#define DMA012_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER42_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA04_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA15_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER33_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define PINT5_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER01_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define UTICK01_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 2) /* PIO0_14 */
#define CTIMER00_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA013_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA00_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER23_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 3) /* PIO0_14 */
#define DMA03_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define SCT01_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 4) /* PIO0_14 */
#define DMA08_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define DMA014_PIO0_14 IOCON_MUX(0, 14, IOCON_TYPE_I, 0) /* PIO0_14 */
#define CTIMER40_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA016_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA05_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA14_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA11_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define CTIMER01_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define PINT0_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define CTIMER11_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define CTIMER10_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA07_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA02_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA014_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA04_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA18_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define PINT5_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA09_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA16_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define PINT2_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define SD0_WR_PRT_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 5) /* PIO0_15 */
#define CTIMER21_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define CTIMER00_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define CTIMER12_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA12_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA00_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA020_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA022_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA017_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define SECPINT1_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 10) /* PIO0_15 */
#define DMA15_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define CTIMER41_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA19_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define ADC02_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define PINT6_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define FC6_CTS_SDA_SSEL0_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 1) /* PIO0_15 */
#define CTIMER30_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define CTIMER22_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA011_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define PINT3_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define SCT02_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 4) /* PIO0_15 */
#define DMA06_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA015_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA01_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define CTIMER32_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define CTIMER33_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA018_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA08_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define CTIMER31_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define GPIO15_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define CTIMER20_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define CTIMER43_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA03_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA17_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define DMA10_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define PINT1_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define CTIMER23_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA13_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define UTICK02_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 2) /* PIO0_15 */
#define DMA010_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define PINT7_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define SECPINT0_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 10) /* PIO0_15 */
#define DMA012_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define PINT4_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define CTIMER13_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA021_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define CTIMER03_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA019_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define CTIMER42_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define CTIMER02_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 3) /* PIO0_15 */
#define DMA013_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 0) /* PIO0_15 */
#define SECGPIO15_PIO0_15 IOCON_MUX(0, 15, IOCON_TYPE_A, 10) /* PIO0_15 */
#define PINT4_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA06_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER01_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define SECGPIO16_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 10) /* PIO0_16 */
#define CTIMER12_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA00_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA010_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA08_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define PINT7_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA10_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define PINT0_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER43_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define CTIMER21_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA016_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define PINT6_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define PINT1_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA022_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER10_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA13_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define PINT2_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA03_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER00_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA07_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA017_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER11_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA018_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define FC4_TXD_SCL_MISO_WS_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 1) /* PIO0_16 */
#define DMA04_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER31_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define CTIMER02_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define CTIMER13_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA020_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA19_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA01_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA012_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER41_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define PINT5_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER23_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define CTIMER32_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA014_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA011_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA15_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define GPIO16_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER22_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA17_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA021_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA02_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER33_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA11_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define PINT3_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA18_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA013_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA015_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER03_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA12_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define SECPINT0_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 10) /* PIO0_16 */
#define DMA16_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define SECPINT1_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 10) /* PIO0_16 */
#define ADC08_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER42_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define CLKOUT_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 2) /* PIO0_16 */
#define DMA14_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA05_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER40_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA019_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define DMA09_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 0) /* PIO0_16 */
#define CTIMER30_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define CTIMER20_PIO0_16 IOCON_MUX(0, 16, IOCON_TYPE_A, 3) /* PIO0_16 */
#define DMA018_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA017_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT0_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT6_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT7_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define SCT00_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 4) /* PIO0_17 */
#define SCT00_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define PINT1_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define SD0_CARD_INT_N_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 8) /* PIO0_17 */
#define SCT02_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define DMA019_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA014_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PLU2_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 9) /* PIO0_17 */
#define DMA14_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA15_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA18_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA011_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT3_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA06_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA13_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define SECPINT0_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 10) /* PIO0_17 */
#define SCT01_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define SECGPIO17_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 10) /* PIO0_17 */
#define PINT4_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define SCT05_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define SCT03_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define DMA16_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA012_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define SECPINT1_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 10) /* PIO0_17 */
#define DMA022_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA17_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA016_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA19_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA05_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA00_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA08_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA02_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define SD0_CARD_DET_N_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 2) /* PIO0_17 */
#define DMA010_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA015_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define SCT06_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define DMA04_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA10_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA11_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA07_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA12_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define SCT04_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define FC4_SSEL2_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 1) /* PIO0_17 */
#define DMA020_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA013_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA03_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT2_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA021_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define GPIO17_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA09_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA01_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT5_PIO0_17 IOCON_MUX(0, 17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA04_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA016_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA02_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA013_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA13_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA012_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define PINT2_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA10_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define PLU3_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 9) /* PIO0_18 */
#define DMA021_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA020_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define PINT0_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define FC4_CTS_SDA_SSEL0_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 1) /* PIO0_18 */
