zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
#define DMA16_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define PINT6_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define SCT01_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 4) /* PIO0_18 */
#define DMA022_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA11_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA014_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define PINT3_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA010_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA03_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define CTIMER10_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 3) /* PIO0_18 */
#define PMC3_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA17_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define GPIO18_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA14_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA09_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA15_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA01_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA019_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define PINT4_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA12_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define SECPINT1_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 10) /* PIO0_18 */
#define DMA017_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA18_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA015_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define PINT5_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA00_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA011_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA07_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA05_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define SECGPIO18_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 10) /* PIO0_18 */
#define DMA018_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define PINT1_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA19_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define DMA08_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define PINT7_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define SECPINT0_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 10) /* PIO0_18 */
#define SD0_WR_PRT_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 2) /* PIO0_18 */
#define DMA06_PIO0_18 IOCON_MUX(0, 18, IOCON_TYPE_A, 0) /* PIO0_18 */
#define PLU4_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 9) /* PIO0_19 */
#define DMA03_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define FC4_RTS_SCL_SSEL1_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 1) /* PIO0_19 */
#define PINT0_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA013_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA17_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT7_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA19_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA017_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA019_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA021_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA05_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT1_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define SECGPIO19_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 10) /* PIO0_19 */
#define UTICK00_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 2) /* PIO0_19 */
#define DMA11_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA09_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT5_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA12_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define CTIMER02_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 3) /* PIO0_19 */
#define PINT2_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define SECPINT1_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 10) /* PIO0_19 */
#define DMA011_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define GPIO19_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA10_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA010_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA020_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define FC7_TXD_SCL_MISO_WS_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 7) /* PIO0_19 */
#define DMA014_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA06_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define SECPINT0_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 10) /* PIO0_19 */
#define DMA02_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA16_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA015_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA022_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define SCT02_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 4) /* PIO0_19 */
#define DMA01_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA18_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA018_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA012_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA08_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA04_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA00_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA15_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA07_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT6_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA016_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA13_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT3_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA14_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT4_PIO0_19 IOCON_MUX(0, 19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA07_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA15_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA19_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA10_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define PINT0_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA012_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define CTIMER22_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define SECPINT1_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 10) /* PIO0_2 */
#define CTIMER32_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define PINT1_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA16_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define CTIMER03_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define CTIMER31_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define DMA18_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define CTIMER12_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define CTIMER42_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define DMA014_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define SCT03_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 4) /* PIO0_2 */
#define CTIMER33_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define DMA011_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA05_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define CTIMER20_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define PINT5_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA016_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define SECGPIO2_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 10) /* PIO0_2 */
#define DMA12_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define CTIMER40_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define CTIMER00_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define CTIMER41_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define DMA018_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define GPIO2_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA11_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define CTIMER13_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define DMA03_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define SCT00_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 4) /* PIO0_2 */
#define DMA017_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define SCT00_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 3) /* PIO0_2 */
#define DMA015_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define SCT04_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 4) /* PIO0_2 */
#define DMA022_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define SCT06_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 4) /* PIO0_2 */
#define CTIMER01_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define CTIMER30_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define PINT6_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define SCT05_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 4) /* PIO0_2 */
#define SCT01_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 4) /* PIO0_2 */
#define PINT7_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA08_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA09_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA00_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA020_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define PINT2_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define SCT02_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 4) /* PIO0_2 */
#define DMA01_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define PINT4_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA013_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define CTIMER21_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define CTIMER02_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define CTIMER43_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define CTIMER11_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define DMA04_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA019_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define PINT3_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA02_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA021_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA06_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define CTIMER10_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define FC3_TXD_SCL_MISO_WS_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 1) /* PIO0_2 */
#define DMA17_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA13_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define CTIMER23_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 2) /* PIO0_2 */
#define DMA010_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define DMA14_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 0) /* PIO0_2 */
#define SECPINT0_PIO0_2 IOCON_MUX(0, 2, IOCON_TYPE_D, 10) /* PIO0_2 */
#define CTIMER12_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA02_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA06_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA013_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define SCT06_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 4) /* PIO0_20 */
#define DMA022_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define SECGPIO20_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 10) /* PIO0_20 */
#define DMA01_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER01_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define SCT01_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 4) /* PIO0_20 */
#define GPIO20_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define PINT7_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define HS_SPI_SSEL0_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 8) /* PIO0_20 */
#define DMA19_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define PINT2_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA10_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define FC3_CTS_SDA_SSEL0_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 1) /* PIO0_20 */
#define SCT03_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 4) /* PIO0_20 */
#define SCT02_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 4) /* PIO0_20 */
#define PINT5_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER31_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA12_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER11_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define CTIMER11_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 2) /* PIO0_20 */
#define DMA11_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA019_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER33_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define CTIMER32_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define CTIMER40_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define SCT05_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 4) /* PIO0_20 */
#define DMA17_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define PINT0_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define PINT6_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER21_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA017_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER22_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA05_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA014_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA00_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA012_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER41_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA16_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER20_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define CTIMER30_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA016_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA011_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA018_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER00_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define PINT1_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define SCT00_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 4) /* PIO0_20 */
#define SECPINT1_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 10) /* PIO0_20 */
#define CTIMER02_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA18_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER13_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA14_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA04_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define PINT3_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER10_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define FC4_TXD_SCL_MISO_WS_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 11) /* PIO0_20 */
#define DMA021_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define PLU5_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 9) /* PIO0_20 */
#define PINT4_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER43_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA03_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define SCT04_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 4) /* PIO0_20 */
#define FC7_RXD_SDA_MOSI_DATA_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 7) /* PIO0_20 */
#define DMA07_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA09_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA020_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER42_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA010_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA15_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA13_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER23_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define SECPINT0_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 10) /* PIO0_20 */
#define CTIMER03_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA08_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA015_PIO0_20 IOCON_MUX(0, 20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA019_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT1_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA07_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA13_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA03_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define SCT00_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define DMA015_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA08_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA05_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA013_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA010_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA19_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PLU_CLKIN_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 9) /* PIO0_21 */
#define SCT03_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define SCT05_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define DMA09_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA04_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT3_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA18_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA012_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA02_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT4_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define SCT04_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define DMA12_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA11_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA16_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT5_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define UTICK03_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 2) /* PIO0_21 */
#define DMA020_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA016_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA018_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT7_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define GPIO21_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA00_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA06_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA022_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define SECGPIO21_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 10) /* PIO0_21 */
#define PINT6_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA021_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA014_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define SCT06_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define DMA17_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA01_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define SCT02_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define DMA017_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT2_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define SECPINT1_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 10) /* PIO0_21 */
#define CTIMER33_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 3) /* PIO0_21 */
#define SECPINT0_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 10) /* PIO0_21 */
#define DMA10_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define FC3_RTS_SCL_SSEL1_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 1) /* PIO0_21 */
#define DMA14_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define PINT0_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define FC7_SCK_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 7) /* PIO0_21 */
#define DMA15_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define DMA011_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 0) /* PIO0_21 */
#define SCT01_PIO0_21 IOCON_MUX(0, 21, IOCON_TYPE_D, 4) /* PIO0_21 */
#define DMA010_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA07_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA17_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER00_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define UTICK01_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 2) /* PIO0_22 */
#define DMA12_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER33_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define SECPINT1_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 10) /* PIO0_22 */
#define DMA00_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER31_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define DMA09_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA015_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA013_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT1_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER23_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define DMA020_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER02_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER42_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define DMA05_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER32_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER22_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER21_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define SDIF0_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 8) /* PIO0_22 */
#define DMA019_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA014_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA018_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER12_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER03_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define DMA16_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT7_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT4_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT3_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA01_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER01_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define CTIMER41_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define DMA15_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define GPIO22_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PLU7_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 9) /* PIO0_22 */
#define DMA02_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA14_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT6_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
