zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
#define CTIMER43_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define FC6_TXD_SCL_MISO_WS_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 1) /* PIO0_22 */
#define CTIMER10_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define DMA10_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA011_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA016_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define SECPINT0_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 10) /* PIO0_22 */
#define DMA13_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER40_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define DMA19_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA06_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA04_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT2_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER30_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define DMA11_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA021_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA012_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER11_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define SCT03_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 4) /* PIO0_22 */
#define SECGPIO22_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 10) /* PIO0_22 */
#define CTIMER20_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define DMA08_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA022_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define CTIMER13_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 3) /* PIO0_22 */
#define USB0_VBUS_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 7) /* PIO0_22 */
#define PINT5_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define PINT0_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA017_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA03_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA18_PIO0_22 IOCON_MUX(0, 22, IOCON_TYPE_D, 0) /* PIO0_22 */
#define DMA017_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA02_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA16_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define FC0_CTS_SDA_SSEL0_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 5) /* PIO0_23 */
#define DMA19_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define ADC00_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define PINT1_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define SECPINT0_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 10) /* PIO0_23 */
#define DMA18_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define PINT5_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define PINT7_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define PINT0_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA019_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define CTIMER12_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 2) /* PIO0_23 */
#define DMA05_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA03_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA17_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA014_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA15_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define CTIMER33_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 3) /* PIO0_23 */
#define DMA020_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define PINT2_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define SECGPIO23_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 10) /* PIO0_23 */
#define DMA12_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define SDIF1_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 8) /* PIO0_23 */
#define DMA012_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA09_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA010_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define GPIO23_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA07_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA022_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA00_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA015_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA01_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define PINT6_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA018_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define MCLK_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 1) /* PIO0_23 */
#define DMA021_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA14_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA04_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define SCT04_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 4) /* PIO0_23 */
#define DMA10_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define PINT3_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define SECPINT1_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 10) /* PIO0_23 */
#define DMA013_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA13_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA11_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA06_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA016_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA08_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define DMA011_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define PINT4_PIO0_23 IOCON_MUX(0, 23, IOCON_TYPE_A, 0) /* PIO0_23 */
#define CTIMER02_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define DMA15_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER41_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define SECPINT0_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 10) /* PIO0_24 */
#define DMA021_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define SCT02_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define DMA16_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA07_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER30_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER22_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define PINT6_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT4_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define SDIF0_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 2) /* PIO0_24 */
#define DMA10_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER40_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define GPIO24_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT2_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER20_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define DMA11_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER10_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define DMA14_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA018_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA08_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA18_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER23_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define PINT7_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA019_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA014_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT5_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER21_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define DMA015_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT0_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER42_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER11_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define DMA04_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA00_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA09_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER00_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define SECPINT1_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 10) /* PIO0_24 */
#define DMA012_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define SCT00_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define DMA19_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER12_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define SCT06_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define CTIMER03_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define DMA011_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA010_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA017_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define SCT01_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define DMA03_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define SECGPIO24_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 10) /* PIO0_24 */
#define DMA13_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA12_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA02_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA17_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA06_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER01_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define DMA05_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER13_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define SCT05_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define DMA01_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define PINT3_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER32_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define CTIMER33_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define DMA013_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER43_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define DMA016_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define DMA022_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define FC0_RXD_SDA_MOSI_DATA_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 1) /* PIO0_24 */
#define DMA020_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define SCT03_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define SCT04_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 4) /* PIO0_24 */
#define CTIMER31_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 3) /* PIO0_24 */
#define PINT1_PIO0_24 IOCON_MUX(0, 24, IOCON_TYPE_D, 0) /* PIO0_24 */
#define CTIMER23_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA00_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define SCT01_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define SCT05_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define CTIMER41_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA11_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA15_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define SCT03_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define PINT7_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT3_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA012_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA016_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define SCT06_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define CTIMER10_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA011_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT1_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define FC0_TXD_SCL_MISO_WS_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 1) /* PIO0_25 */
#define DMA14_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA09_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define CTIMER31_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA17_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA16_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define GPIO25_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define SCT00_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define DMA10_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define CTIMER21_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA05_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define SECGPIO25_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 10) /* PIO0_25 */
#define SECPINT1_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 10) /* PIO0_25 */
#define PINT5_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA03_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define CTIMER30_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER22_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA13_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA013_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define CTIMER02_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER33_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA014_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA02_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define CTIMER12_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER01_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA08_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define SDIF1_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 2) /* PIO0_25 */
#define CTIMER13_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER42_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA12_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA06_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define SECPINT0_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 10) /* PIO0_25 */
#define CTIMER00_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA015_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA021_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA017_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define CTIMER40_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER11_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA010_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA07_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define SCT04_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define DMA04_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define CTIMER43_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA19_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA18_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define SCT02_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 4) /* PIO0_25 */
#define CTIMER32_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define CTIMER03_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define DMA020_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA01_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT0_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA019_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define CTIMER20_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 3) /* PIO0_25 */
#define PINT4_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA022_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define DMA018_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT6_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define PINT2_PIO0_25 IOCON_MUX(0, 25, IOCON_TYPE_D, 0) /* PIO0_25 */
#define CTIMER21_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER01_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA14_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA017_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define PINT0_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA011_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define PINT2_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA018_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define PINT4_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER30_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA012_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define SCT05_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 4) /* PIO0_26 */
#define FC0_SCK_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 8) /* PIO0_26 */
#define CTIMER41_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA03_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER11_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA021_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER22_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA10_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA06_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define PINT3_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define PINT6_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA09_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA17_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA013_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define PINT5_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA019_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER20_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA19_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA18_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA12_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA010_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define SECGPIO26_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 10) /* PIO0_26 */
#define DMA00_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER43_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA07_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA016_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER00_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER03_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define USB0_IDVALUE_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 7) /* PIO0_26 */
#define CTIMER40_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER32_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA01_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER12_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define PINT1_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER31_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER13_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define SECPINT0_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 10) /* PIO0_26 */
#define DMA022_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER23_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define CTIMER02_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA015_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER33_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define SECPINT1_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 10) /* PIO0_26 */
#define CTIMER42_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA05_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define PINT7_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA13_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define GPIO26_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CLKOUT_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 2) /* PIO0_26 */
#define DMA08_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define CTIMER10_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 3) /* PIO0_26 */
#define DMA02_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA11_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA014_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define FC2_RXD_SDA_MOSI_DATA_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 1) /* PIO0_26 */
#define DMA16_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA020_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA15_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define DMA04_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 0) /* PIO0_26 */
#define HS_SPI_MOSI_PIO0_26 IOCON_MUX(0, 26, IOCON_TYPE_D, 9) /* PIO0_26 */
#define DMA04_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA09_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA020_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA07_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA10_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA011_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA18_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define SECGPIO27_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 10) /* PIO0_27 */
#define DMA013_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA16_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define FC2_TXD_SCL_MISO_WS_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 1) /* PIO0_27 */
#define DMA08_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA17_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA19_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA016_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA019_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT4_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA018_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT5_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA06_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA02_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA01_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT0_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA012_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA14_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA13_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA00_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define GPIO27_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA017_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT3_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA021_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT6_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define FC7_RXD_SDA_MOSI_DATA_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 7) /* PIO0_27 */
#define DMA11_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define CTIMER32_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 3) /* PIO0_27 */
