zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
#define DMA05_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA12_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT1_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA010_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA014_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define SECPINT1_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 10) /* PIO0_27 */
#define SCT06_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 4) /* PIO0_27 */
#define DMA015_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA022_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT7_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define SECPINT0_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 10) /* PIO0_27 */
#define DMA15_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define DMA03_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PINT2_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 0) /* PIO0_27 */
#define PLU0_PIO0_27 IOCON_MUX(0, 27, IOCON_TYPE_D, 9) /* PIO0_27 */
#define CTIMER40_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA16_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT4_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define GPIO28_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define SECGPIO28_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 10) /* PIO0_28 */
#define DMA06_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PLU1_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 9) /* PIO0_28 */
#define CTIMER42_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define CTIMER41_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA17_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define FC0_SCK_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 1) /* PIO0_28 */
#define DMA03_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA016_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define SCT07_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 4) /* PIO0_28 */
#define CTIMER23_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define PINT2_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define CTIMER13_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA00_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define CTIMER30_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define CTIMER20_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA012_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA01_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA017_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT5_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA12_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA019_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA10_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define SECPINT0_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 10) /* PIO0_28 */
#define DMA15_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA022_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA014_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA18_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define SD1_CMD_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 2) /* PIO0_28 */
#define CTIMER22_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define CTIMER00_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA013_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT3_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA05_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA13_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA010_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define CTIMER43_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define SECPINT1_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 10) /* PIO0_28 */
#define CTIMER01_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA09_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA020_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT0_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define CTIMER33_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define CTIMER32_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA08_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA018_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA14_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT6_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define USB0_OVERCURRENTN_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 7) /* PIO0_28 */
#define CTIMER10_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA04_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define PINT1_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA021_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define CTIMER03_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA19_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define CTIMER21_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define PINT7_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define CTIMER12_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define DMA11_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA02_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA07_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA015_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define DMA011_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 0) /* PIO0_28 */
#define CTIMER02_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define CTIMER31_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define CTIMER11_PIO0_28 IOCON_MUX(0, 28, IOCON_TYPE_D, 3) /* PIO0_28 */
#define PINT0_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA021_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define GPIO29_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define SECPINT1_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 10) /* PIO0_29 */
#define SECGPIO29_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 10) /* PIO0_29 */
#define CTIMER23_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 3) /* PIO0_29 */
#define DMA05_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA022_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define SECPINT0_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 10) /* PIO0_29 */
#define PINT6_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT7_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA12_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA11_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT4_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA08_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA09_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA07_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA017_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA012_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT2_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA19_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA17_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA01_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define SDIF2_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 2) /* PIO0_29 */
#define PINT3_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA18_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA06_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA014_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA14_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define CMP0_OUT_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 7) /* PIO0_29 */
#define DMA16_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define FC0_RXD_SDA_MOSI_DATA_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 1) /* PIO0_29 */
#define DMA010_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA015_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA016_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA018_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA013_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA00_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA13_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA03_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT5_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA019_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA011_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA04_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define SCT08_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 4) /* PIO0_29 */
#define DMA15_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA02_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PLU2_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 9) /* PIO0_29 */
#define DMA10_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define PINT1_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA020_PIO0_29 IOCON_MUX(0, 29, IOCON_TYPE_D, 0) /* PIO0_29 */
#define DMA019_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA016_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA10_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA05_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SECGPIO3_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 10) /* PIO0_3 */
#define DMA18_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA15_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SCT01_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 4) /* PIO0_3 */
#define DMA022_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SCT01_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 3) /* PIO0_3 */
#define DMA013_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA04_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SCT05_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 4) /* PIO0_3 */
#define GPIO3_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA17_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA011_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA19_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA06_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA00_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA018_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA08_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define PINT5_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA020_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA012_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA07_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA015_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SCT03_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 4) /* PIO0_3 */
#define PINT1_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define PINT3_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA02_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA03_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SCT00_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 4) /* PIO0_3 */
#define PINT0_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SECPINT0_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 10) /* PIO0_3 */
#define PINT4_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define PINT7_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA13_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define PINT6_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define CTIMER01_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 2) /* PIO0_3 */
#define DMA14_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SCT04_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 4) /* PIO0_3 */
#define DMA09_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SCT06_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 4) /* PIO0_3 */
#define DMA16_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define FC3_RXD_SDA_MOSI_DATA_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 1) /* PIO0_3 */
#define DMA017_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA021_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA12_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SCT02_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 4) /* PIO0_3 */
#define DMA014_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define SECPINT1_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 10) /* PIO0_3 */
#define DMA01_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA010_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define PINT2_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA11_PIO0_3 IOCON_MUX(0, 3, IOCON_TYPE_D, 0) /* PIO0_3 */
#define DMA14_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT5_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA016_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA13_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA03_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT2_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT0_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA010_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT1_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA06_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT3_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA011_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA19_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA18_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA07_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define SECGPIO30_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 10) /* PIO0_30 */
#define DMA01_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA09_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT7_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define FC0_TXD_SCL_MISO_WS_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 1) /* PIO0_30 */
#define DMA16_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define PINT4_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA013_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define SCT09_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 4) /* PIO0_30 */
#define DMA019_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA012_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define GPIO30_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA021_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA05_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define CTIMER00_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 3) /* PIO0_30 */
#define DMA12_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA08_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA17_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA11_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA022_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA020_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA014_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA10_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA018_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA04_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA015_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA00_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define SECPINT0_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 10) /* PIO0_30 */
#define PINT6_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define SDIF3_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 2) /* PIO0_30 */
#define DMA017_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA02_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define DMA15_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 0) /* PIO0_30 */
#define SECPINT1_PIO0_30 IOCON_MUX(0, 30, IOCON_TYPE_D, 10) /* PIO0_30 */
#define DMA01_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define PINT0_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA10_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define PINT1_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define PINT5_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define SECPINT0_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 10) /* PIO0_31 */
#define DMA18_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define SDIF2_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 2) /* PIO0_31 */
#define SECGPIO31_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 10) /* PIO0_31 */
#define DMA02_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define PINT2_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA14_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA08_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA016_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA014_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA07_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA13_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA05_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA11_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA00_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define ADC03_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define PINT7_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA19_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define CTIMER01_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 3) /* PIO0_31 */
#define SCT03_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 4) /* PIO0_31 */
#define PINT4_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define FC0_CTS_SDA_SSEL0_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 1) /* PIO0_31 */
#define DMA16_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA12_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA020_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA013_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA04_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define PINT6_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA03_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA09_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA018_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA06_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA015_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA019_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA012_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define PINT3_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA011_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA017_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define SECPINT1_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 10) /* PIO0_31 */
#define DMA15_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA022_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA021_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define GPIO31_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA010_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA17_PIO0_31 IOCON_MUX(0, 31, IOCON_TYPE_A, 0) /* PIO0_31 */
#define DMA019_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT5_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA011_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA17_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER12_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA010_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define SCT05_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 4) /* PIO0_4 */
#define PINT4_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT3_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA021_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA04_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define SECPINT0_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 10) /* PIO0_4 */
#define DMA06_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER00_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define PINT2_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define SECPINT1_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 10) /* PIO0_4 */
#define CTIMER41_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA016_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA13_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA07_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT0_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER30_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA01_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA11_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER32_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA022_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA03_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER03_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define CTIMER10_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define SCT04_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 4) /* PIO0_4 */
#define DMA10_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT1_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA012_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA08_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER11_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA15_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER13_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA16_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER43_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define CTIMER01_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define CTIMER23_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA09_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define SCT06_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 4) /* PIO0_4 */
#define CTIMER42_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define SCT01_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 4) /* PIO0_4 */
#define PINT7_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA00_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER40_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA12_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define SCT00_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 4) /* PIO0_4 */
#define GPIO4_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA18_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
