zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
#define DMA02_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define PINT6_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA05_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA14_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER22_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define FC4_SCK_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 2) /* PIO0_4 */
#define SECGPIO4_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 10) /* PIO0_4 */
#define DMA014_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER20_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA018_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define FC3_CTS_SDA_SSEL0_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 8) /* PIO0_4 */
#define CTIMER31_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA013_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER02_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define SCT03_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 4) /* PIO0_4 */
#define DMA015_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define CTIMER21_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA017_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA19_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define DMA020_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 0) /* PIO0_4 */
#define SCT02_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 4) /* PIO0_4 */
#define CTIMER33_PIO0_4 IOCON_MUX(0, 4, IOCON_TYPE_D, 3) /* PIO0_4 */
#define DMA04_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA06_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA16_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA01_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA17_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define SECGPIO5_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define DMA07_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA12_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA020_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA015_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA18_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT1_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA014_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA03_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA09_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA10_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define MCLK_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 9) /* PIO0_5 */
#define PINT5_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define SCT05_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 4) /* PIO0_5 */
#define SCT00_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 4) /* PIO0_5 */
#define CTIMER30_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 3) /* PIO0_5 */
#define DMA011_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT2_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA021_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT3_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define FC3_RTS_SCL_SSEL1_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 8) /* PIO0_5 */
#define DMA00_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define GPIO5_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define SCT06_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 4) /* PIO0_5 */
#define DMA02_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define SCT03_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 4) /* PIO0_5 */
#define DMA13_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA022_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA11_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA016_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT6_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA013_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA05_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT7_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define SECPINT1_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define SCT01_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 4) /* PIO0_5 */
#define DMA019_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define SECPINT0_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 10) /* PIO0_5 */
#define DMA010_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA08_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define SCT02_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 4) /* PIO0_5 */
#define FC4_RXD_SDA_MOSI_DATA_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 2) /* PIO0_5 */
#define DMA19_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA15_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA018_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA14_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define DMA017_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT4_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define PINT0_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define SCT04_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 4) /* PIO0_5 */
#define DMA012_PIO0_5 IOCON_MUX(0, 5, IOCON_TYPE_D, 0) /* PIO0_5 */
#define SCT01_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 4) /* PIO0_6 */
#define SCT04_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 4) /* PIO0_6 */
#define SCT02_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 4) /* PIO0_6 */
#define CTIMER20_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define PINT3_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER10_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA17_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER02_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA09_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA07_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA018_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT5_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT0_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA13_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA010_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER42_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA08_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA013_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER13_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA03_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define FC3_SCK_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 1) /* PIO0_6 */
#define PINT1_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT7_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT2_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER03_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA020_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define SECGPIO6_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define CTIMER40_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 3) /* PIO0_6 */
#define CTIMER00_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA19_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER40_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA019_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define SCT03_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 4) /* PIO0_6 */
#define DMA11_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER12_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA014_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER31_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define CTIMER30_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA14_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER01_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA016_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA18_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA017_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA021_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA012_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA04_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define GPIO6_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA00_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define PINT6_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER21_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define PINT4_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA011_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define SCT06_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 4) /* PIO0_6 */
#define DMA16_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER41_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define DMA02_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define SCT00_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 4) /* PIO0_6 */
#define DMA10_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA01_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA05_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA06_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER33_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define SCT05_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 4) /* PIO0_6 */
#define CTIMER23_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define SECPINT1_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define DMA15_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA015_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define CTIMER32_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define CTIMER22_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define CTIMER11_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define CTIMER43_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 2) /* PIO0_6 */
#define SECPINT0_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 10) /* PIO0_6 */
#define DMA12_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define DMA022_PIO0_6 IOCON_MUX(0, 6, IOCON_TYPE_D, 0) /* PIO0_6 */
#define FC3_RTS_SCL_SSEL1_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 1) /* PIO0_7 */
#define PINT3_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA11_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA021_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA022_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA011_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA020_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA05_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define FC1_SCK_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 4) /* PIO0_7 */
#define DMA18_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA17_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA15_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA07_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT5_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA04_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA03_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA10_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT2_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA016_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT1_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA14_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT7_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define SECPINT1_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define SD0_CLK_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 2) /* PIO0_7 */
#define PINT4_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA12_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define SECPINT0_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define PINT6_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA017_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA015_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA09_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA06_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA01_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA012_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA018_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA19_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define PINT0_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA02_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA00_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define FC5_SCK_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 3) /* PIO0_7 */
#define DMA13_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA014_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA16_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA019_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA010_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA013_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define GPIO7_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define SECGPIO7_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 10) /* PIO0_7 */
#define DMA08_PIO0_7 IOCON_MUX(0, 7, IOCON_TYPE_D, 0) /* PIO0_7 */
#define DMA016_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA11_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define SD0_CMD_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 2) /* PIO0_8 */
#define PINT2_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA012_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA12_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA018_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT0_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT4_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA020_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define FC3_SSEL3_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 1) /* PIO0_8 */
#define DMA013_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define SECGPIO8_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define DMA02_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA022_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT3_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA09_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define GPIO8_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA16_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA011_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA15_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define SECPINT1_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define DMA18_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA00_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA07_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define FC5_RXD_SDA_MOSI_DATA_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 3) /* PIO0_8 */
#define PINT1_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA13_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA017_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA19_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA010_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA019_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA03_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA14_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA014_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA06_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define SECPINT0_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 10) /* PIO0_8 */
#define DMA01_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA17_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA08_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA015_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT7_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA021_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define SWO_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 4) /* PIO0_8 */
#define PINT5_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA04_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA10_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA05_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define PINT6_PIO0_8 IOCON_MUX(0, 8, IOCON_TYPE_D, 0) /* PIO0_8 */
#define DMA010_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA06_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA13_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA05_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define PINT4_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define PINT5_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA01_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA011_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA19_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA021_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define FC3_SSEL2_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 1) /* PIO0_9 */
#define DMA014_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define SECPINT0_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 10) /* PIO0_9 */
#define PINT6_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA013_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define PINT0_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA012_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA04_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define PINT1_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA07_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define PINT2_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA16_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define FC5_TXD_SCL_MISO_WS_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 3) /* PIO0_9 */
#define SD0_POW_EN_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 2) /* PIO0_9 */
#define DMA11_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA016_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA17_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define PMC2_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA10_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA18_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA14_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define SECGPIO9_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 10) /* PIO0_9 */
#define SECPINT1_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 10) /* PIO0_9 */
#define DMA12_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA019_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define PINT3_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA08_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA017_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA020_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA09_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA15_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA03_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA02_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA018_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define PINT7_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA015_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA022_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define GPIO9_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define DMA00_PIO0_9 IOCON_MUX(0, 9, IOCON_TYPE_A, 0) /* PIO0_9 */
#define CTIMER21_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define CTIMER01_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define DMA06_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA018_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA08_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER00_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define DMA02_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA012_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER33_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define SCT01_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 4) /* PIO1_0 */
#define DMA07_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA17_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA05_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define SCT06_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 4) /* PIO1_0 */
#define SDIF3_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 2) /* PIO1_0 */
#define PINT0_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define FC0_RTS_SCL_SSEL1_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 1) /* PIO1_0 */
#define CTIMER31_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define PINT6_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER22_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define DMA021_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA020_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define SCT02_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 4) /* PIO1_0 */
#define CTIMER12_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define DMA014_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define ADC011_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA011_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER13_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define DMA03_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define PINT5_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER23_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define CTIMER11_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define DMA10_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER20_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define DMA00_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define PINT4_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER02_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define PINT3_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER40_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define CTIMER41_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define DMA04_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define PINT2_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER43_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define SCT00_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 4) /* PIO1_0 */
#define DMA16_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA09_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER10_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define SCT04_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 4) /* PIO1_0 */
#define DMA016_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define SCT05_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 4) /* PIO1_0 */
#define DMA010_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA017_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA14_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
