zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
#define DMA022_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA01_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA015_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define SCT03_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 4) /* PIO1_0 */
#define CTIMER42_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define CTIMER30_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define PINT1_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER32_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define DMA18_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA11_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define PINT7_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA19_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA13_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define PLU3_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 9) /* PIO1_0 */
#define DMA12_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA013_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define CTIMER03_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 3) /* PIO1_0 */
#define DMA15_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define GPIO0_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA019_PIO1_0 IOCON_MUX(1, 0, IOCON_TYPE_A, 0) /* PIO1_0 */
#define DMA12_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define CTIMER32_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define CTIMER10_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define DMA014_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT4_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT3_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define SCT04_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 4) /* PIO1_1 */
#define CTIMER21_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define CTIMER11_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define DMA011_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define CTIMER42_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define FC3_RXD_SDA_MOSI_DATA_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 1) /* PIO1_1 */
#define PINT0_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA16_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT7_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define SCT05_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 4) /* PIO1_1 */
#define DMA14_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT6_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA017_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define CTIMER31_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define DMA021_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA02_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA020_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA15_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PLU4_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 9) /* PIO1_1 */
#define SCT06_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 4) /* PIO1_1 */
#define DMA13_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA04_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA11_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA08_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT5_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define SCT02_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 4) /* PIO1_1 */
#define CTIMER12_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define CTIMER41_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define USB1_OVERCURRENTN_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 7) /* PIO1_1 */
#define DMA019_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define SCT00_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 4) /* PIO1_1 */
#define CTIMER01_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define CTIMER22_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define DMA013_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA022_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA00_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA01_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA06_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define CTIMER03_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define DMA018_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define CTIMER30_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define DMA07_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define HS_SPI_SSEL1_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 5) /* PIO1_1 */
#define DMA18_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA17_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define CTIMER23_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define CTIMER00_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define CTIMER02_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define CTIMER33_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define CTIMER20_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define DMA016_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define PINT1_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA012_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA09_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA05_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA10_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA010_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA03_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define SCT03_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 4) /* PIO1_1 */
#define SCT01_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 4) /* PIO1_1 */
#define CTIMER43_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define CTIMER13_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define PINT2_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define CTIMER40_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 3) /* PIO1_1 */
#define DMA19_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA015_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define GPIO1_PIO1_1 IOCON_MUX(1, 1, IOCON_TYPE_D, 0) /* PIO1_1 */
#define DMA09_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA04_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA03_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT3_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA12_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT1_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA17_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA011_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define GPIO10_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT6_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define FC1_RXD_SDA_MOSI_DATA_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 2) /* PIO1_10 */
#define DMA019_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA014_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA10_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA012_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA07_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT7_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA05_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA016_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA06_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA010_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA020_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA018_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT0_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA017_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT4_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA16_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT5_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA11_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define CTIMER10_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 3) /* PIO1_10 */
#define DMA18_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA022_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA15_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA14_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA021_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA015_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA02_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA08_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA00_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA19_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA013_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA01_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT2_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define SCT03_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 4) /* PIO1_10 */
#define DMA13_PIO1_10 IOCON_MUX(1, 10, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT6_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER12_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define PINT5_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT7_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER22_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define PINT3_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA18_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER31_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA013_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT1_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER10_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA021_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER21_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA04_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define FC1_TXD_SCL_MISO_WS_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 2) /* PIO1_11 */
#define DMA015_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define USB0_VBUS_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 4) /* PIO1_11 */
#define DMA018_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA19_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA16_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER41_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA17_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER40_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA10_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA014_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA016_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER20_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA07_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA020_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA012_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER42_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA02_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA12_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA14_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA00_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA01_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA15_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT2_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER33_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define CTIMER03_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define CTIMER02_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define CTIMER32_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define CTIMER11_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define CTIMER00_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA06_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA022_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define GPIO11_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT0_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA05_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA13_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA010_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA11_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA017_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER13_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA08_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT4_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER23_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA03_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER30_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA019_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA09_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER01_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define CTIMER43_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA011_PIO1_11 IOCON_MUX(1, 11, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT5_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define HS_SPI_SSEL2_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 5) /* PIO1_12 */
#define DMA10_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define GPIO12_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA11_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA03_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA015_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT4_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define CTIMER11_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 3) /* PIO1_12 */
#define DMA06_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define USB0_PORTPWRN_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 4) /* PIO1_12 */
#define DMA016_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT7_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA021_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT3_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA18_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA014_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT2_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA08_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA017_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA09_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA17_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA02_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA011_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA00_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA01_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA12_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA15_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA013_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA020_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT1_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT0_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA04_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA018_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA019_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA05_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA19_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA14_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA13_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA07_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT6_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define FC6_SCK_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 2) /* PIO1_12 */
#define DMA012_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA022_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA010_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA16_PIO1_12 IOCON_MUX(1, 12, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA014_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA18_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT1_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA021_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER11_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA02_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER21_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define USB0_FRAME_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 5) /* PIO1_13 */
#define CTIMER43_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define CTIMER42_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA13_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA012_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT4_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA09_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA05_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER22_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA020_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER30_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define CTIMER00_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define SD0_CARD_DET_N_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 7) /* PIO1_13 */
#define CTIMER13_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define CTIMER41_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define PINT7_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER40_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define USB0_OVERCURRENTN_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 4) /* PIO1_13 */
#define CTIMER23_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA016_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER12_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA015_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA019_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA07_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA022_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA018_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT2_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT0_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA01_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA06_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER20_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA12_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT6_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER10_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA15_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT3_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER32_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA19_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER02_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA10_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA013_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER31_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA03_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA017_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA011_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER01_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA08_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA17_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA14_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER33_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA16_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA11_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA010_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA00_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define GPIO13_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT5_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA04_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 0) /* PIO1_13 */
#define FC6_RXD_SDA_MOSI_DATA_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 2) /* PIO1_13 */
#define CTIMER03_PIO1_13 IOCON_MUX(1, 13, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA012_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define PINT4_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA016_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA13_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA04_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define UTICK02_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 2) /* PIO1_14 */
#define PINT0_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define USB0_LEDN_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 5) /* PIO1_14 */
#define DMA013_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA07_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA021_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA015_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA15_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA19_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA011_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA11_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA12_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define PINT3_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define GPIO14_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define PINT1_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA05_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA020_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA17_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define PMC4_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA017_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA06_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
