zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
#define PINT6_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA02_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define FC5_CTS_SDA_SSEL0_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 4) /* PIO1_14 */
#define SD1_CMD_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 7) /* PIO1_14 */
#define DMA019_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA16_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA018_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA10_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA08_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define PINT7_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define PINT2_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA022_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA18_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define CTIMER12_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 3) /* PIO1_14 */
#define DMA014_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA01_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA14_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA03_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA00_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA010_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA09_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define PINT5_PIO1_14 IOCON_MUX(1, 14, IOCON_TYPE_A, 0) /* PIO1_14 */
#define DMA011_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA013_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT4_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER11_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER10_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define PINT5_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define FC5_RTS_SCL_SSEL1_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 4) /* PIO1_15 */
#define DMA02_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA18_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA16_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define UTICK03_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 2) /* PIO1_15 */
#define DMA01_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT7_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER22_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA14_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define GPIO15_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA012_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER43_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA10_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER13_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER32_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA13_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT6_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT2_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA017_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA05_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER41_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA010_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER00_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA019_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA021_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA020_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA016_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT3_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define SDIF2_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 7) /* PIO1_15 */
#define DMA19_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER40_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA08_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA03_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT1_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER21_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA04_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA015_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA12_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER12_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA09_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA022_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER42_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER23_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER20_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA014_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER02_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER03_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER01_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA11_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA00_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER31_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define FC4_RTS_SCL_SSEL1_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 5) /* PIO1_15 */
#define CTIMER30_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define CTIMER33_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 3) /* PIO1_15 */
#define PINT0_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA06_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA018_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA15_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA07_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA17_PIO1_15 IOCON_MUX(1, 15, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA06_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA17_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA010_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA13_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA017_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define GPIO16_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT4_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT6_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA015_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA014_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA021_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA07_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA018_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA013_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT3_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA019_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA00_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA04_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA19_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA03_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT7_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA08_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA09_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA16_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define CTIMER13_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 3) /* PIO1_16 */
#define DMA022_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA12_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA02_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA15_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT1_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define FC6_TXD_SCL_MISO_WS_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 2) /* PIO1_16 */
#define DMA14_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define SD0_CMD_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 4) /* PIO1_16 */
#define DMA011_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA18_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA012_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA05_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT2_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT5_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA020_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA11_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT0_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA01_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA10_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA016_PIO1_16 IOCON_MUX(1, 16, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA18_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA10_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA12_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA15_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA07_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT0_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define SCT04_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 4) /* PIO1_17 */
#define DMA016_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT3_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA011_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA013_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA012_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA01_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA04_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA05_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA020_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA16_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA19_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT5_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA014_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA018_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA017_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA08_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA02_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT4_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT7_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA021_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define SD1_CARD_INT_N_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 7) /* PIO1_17 */
#define PINT1_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA14_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA11_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT2_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define FC6_RTS_SCL_SSEL1_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 3) /* PIO1_17 */
#define GPIO17_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA06_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA03_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA13_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA019_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT6_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA015_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA010_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA00_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA09_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA17_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA022_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 0) /* PIO1_17 */
#define SD1_CARD_DET_N_PIO1_17 IOCON_MUX(1, 17, IOCON_TYPE_D, 9) /* PIO1_17 */
#define DMA011_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT0_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA019_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA03_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define SD1_POW_EN_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 1) /* PIO1_18 */
#define DMA11_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA015_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA00_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA013_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PLU0_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 7) /* PIO1_18 */
#define DMA08_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA13_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA016_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define SCT05_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 4) /* PIO1_18 */
#define GPIO18_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA18_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA04_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA022_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA06_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA15_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA020_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT5_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA017_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA021_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT4_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA05_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA14_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA10_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA014_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA16_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA09_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA01_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA010_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA07_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT6_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA012_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA12_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT1_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA19_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT2_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT7_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA17_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define PINT3_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA02_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA018_PIO1_18 IOCON_MUX(1, 18, IOCON_TYPE_D, 0) /* PIO1_18 */
#define DMA15_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA19_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA10_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define SCT03_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 4) /* PIO1_19 */
#define PINT1_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA04_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA05_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA12_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define ACMPVREF_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA02_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA09_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define PINT3_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define SCT02_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 4) /* PIO1_19 */
#define SCT01_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 4) /* PIO1_19 */
#define PINT5_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA07_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA012_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA06_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define SCT07_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 2) /* PIO1_19 */
#define DMA021_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA14_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA014_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA00_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA019_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA013_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define PINT4_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA03_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA17_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define SCT04_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 4) /* PIO1_19 */
#define CTIMER31_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 3) /* PIO1_19 */
#define DMA08_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA18_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define PINT0_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA017_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define PINT2_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA010_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA11_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA016_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define SCT05_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 4) /* PIO1_19 */
#define DMA13_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA022_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define PINT6_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define FC4_SCK_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 5) /* PIO1_19 */
#define GPIO19_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA020_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA011_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA015_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA16_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define PLU1_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 7) /* PIO1_19 */
#define PINT7_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define SCT00_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 4) /* PIO1_19 */
#define SCT06_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 4) /* PIO1_19 */
#define DMA01_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define DMA018_PIO1_19 IOCON_MUX(1, 19, IOCON_TYPE_A, 0) /* PIO1_19 */
#define PINT0_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA011_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA15_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA01_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA04_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA021_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA014_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA10_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA16_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA020_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define USB1_PORTPWRN_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 7) /* PIO1_2 */
#define SCT06_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 4) /* PIO1_2 */
#define DMA18_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA010_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define PINT1_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define GPIO2_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA13_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA14_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA019_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA07_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA09_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA00_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define PINT6_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define CTIMER03_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 3) /* PIO1_2 */
#define DMA19_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA17_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA012_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define PINT2_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define SCT04_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 4) /* PIO1_2 */
#define SCT00_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 4) /* PIO1_2 */
#define SCT03_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 4) /* PIO1_2 */
#define SCT01_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 4) /* PIO1_2 */
#define DMA05_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA022_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define SCT02_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 4) /* PIO1_2 */
#define DMA08_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define PINT3_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define PLU5_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 9) /* PIO1_2 */
#define PINT4_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA06_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA11_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA016_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA12_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define HS_SPI_SCK_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 6) /* PIO1_2 */
#define SCT05_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 4) /* PIO1_2 */
#define DMA03_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define PINT7_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA013_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA018_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA015_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define PINT5_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA02_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define DMA017_PIO1_2 IOCON_MUX(1, 2, IOCON_TYPE_D, 0) /* PIO1_2 */
#define CTIMER33_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define PINT6_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA14_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA02_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA011_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER40_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER01_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER43_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER31_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA16_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
