zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
#define CTIMER22_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA022_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA012_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA06_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA016_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA00_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER32_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER20_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA08_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA10_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA13_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA010_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA04_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT4_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT7_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA017_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT1_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define FC7_RTS_SCL_SSEL1_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 1) /* PIO1_20 */
#define DMA021_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER21_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define PINT0_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER41_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define PLU2_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 7) /* PIO1_20 */
#define DMA11_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER23_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER11_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define CTIMER02_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA05_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER03_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA013_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA12_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define FC4_TXD_SCL_MISO_WS_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 5) /* PIO1_20 */
#define CTIMER30_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA015_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA03_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER42_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define PINT3_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER00_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA17_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER10_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA020_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA07_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA15_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA019_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define GPIO20_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER13_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA09_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA18_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA19_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA01_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA014_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT2_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define CTIMER12_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 3) /* PIO1_20 */
#define DMA018_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define PINT5_PIO1_20 IOCON_MUX(1, 20, IOCON_TYPE_D, 0) /* PIO1_20 */
#define DMA013_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA07_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA03_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA014_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA13_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT6_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA011_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA09_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT5_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT2_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA16_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA02_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA18_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA017_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define GPIO21_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA10_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA08_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA05_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT7_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define FC7_CTS_SDA_SSEL0_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 1) /* PIO1_21 */
#define DMA010_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA14_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA15_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define CTIMER32_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 3) /* PIO1_21 */
#define DMA020_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT3_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA04_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA018_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA00_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA19_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PLU3_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 7) /* PIO1_21 */
#define DMA016_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT4_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA015_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA021_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA022_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA17_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA019_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define FC4_RXD_SDA_MOSI_DATA_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 5) /* PIO1_21 */
#define DMA06_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT1_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define PINT0_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA12_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA11_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA01_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA012_PIO1_21 IOCON_MUX(1, 21, IOCON_TYPE_D, 0) /* PIO1_21 */
#define DMA07_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA15_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA12_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA018_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define SCT03_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 4) /* PIO1_22 */
#define DMA021_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT3_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PLU4_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 7) /* PIO1_22 */
#define PINT4_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define GPIO22_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define SCT05_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 4) /* PIO1_22 */
#define DMA012_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define SCT00_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 4) /* PIO1_22 */
#define DMA00_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA04_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA09_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA08_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA019_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA014_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA015_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA03_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define FC4_SSEL3_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 5) /* PIO1_22 */
#define DMA05_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA13_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA16_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA017_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA01_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA016_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define SCT04_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 4) /* PIO1_22 */
#define DMA010_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT7_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA02_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA022_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA020_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT6_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA011_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT0_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA06_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA14_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define SCT06_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 4) /* PIO1_22 */
#define DMA013_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT5_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define SCT01_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 4) /* PIO1_22 */
#define DMA11_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define PINT1_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define SD0_CMD_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 2) /* PIO1_22 */
#define CTIMER23_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 3) /* PIO1_22 */
#define DMA17_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA10_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA18_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA19_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define SCT02_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 4) /* PIO1_22 */
#define PINT2_PIO1_22 IOCON_MUX(1, 22, IOCON_TYPE_D, 0) /* PIO1_22 */
#define DMA04_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA14_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA020_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define GPIO23_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA10_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA017_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA019_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA09_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA00_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA010_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT6_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA021_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA05_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA16_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA12_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA06_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA07_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT1_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA012_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA013_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA13_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT3_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA19_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA015_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA17_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define FC2_SCK_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 1) /* PIO1_23 */
#define DMA11_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT5_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define SCT00_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 2) /* PIO1_23 */
#define PINT7_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA08_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA018_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PLU5_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 7) /* PIO1_23 */
#define FC3_SSEL2_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 5) /* PIO1_23 */
#define DMA011_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT0_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT2_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA02_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define PINT4_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA014_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA18_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA01_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define SDIF3_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 3) /* PIO1_23 */
#define DMA03_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA15_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA022_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA016_PIO1_23 IOCON_MUX(1, 23, IOCON_TYPE_D, 0) /* PIO1_23 */
#define DMA09_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA015_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA15_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA020_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA03_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA01_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA14_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA02_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA16_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define SDIF1_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 3) /* PIO1_24 */
#define FC3_SSEL3_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 5) /* PIO1_24 */
#define DMA17_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA022_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA05_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA07_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define SCT01_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 2) /* PIO1_24 */
#define DMA014_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define GPIO24_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA19_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA13_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA021_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT5_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT7_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA12_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA012_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PLU6_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 7) /* PIO1_24 */
#define DMA017_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT4_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA06_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA019_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT1_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT3_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA018_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA010_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT6_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT0_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA11_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA18_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA00_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA011_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define FC2_RXD_SDA_MOSI_DATA_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 1) /* PIO1_24 */
#define DMA04_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA013_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT2_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA10_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA08_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define DMA016_PIO1_24 IOCON_MUX(1, 24, IOCON_TYPE_D, 0) /* PIO1_24 */
#define PINT5_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define SDIF0_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 3) /* PIO1_25 */
#define DMA15_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA00_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA06_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT7_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA014_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA018_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT0_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA08_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define SCT02_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 2) /* PIO1_25 */
#define DMA14_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA011_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT6_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA16_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA015_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA05_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA11_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA18_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define FC2_TXD_SCL_MISO_WS_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 1) /* PIO1_25 */
#define DMA022_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA016_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA10_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA04_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA010_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT1_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA12_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define UTICK00_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 4) /* PIO1_25 */
#define DMA01_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT4_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA021_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA03_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA09_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA02_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA19_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA017_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA013_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define GPIO25_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT3_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA13_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PINT2_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA012_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA020_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA07_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define PLU_CLKIN_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 7) /* PIO1_25 */
#define DMA019_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA17_PIO1_25 IOCON_MUX(1, 25, IOCON_TYPE_D, 0) /* PIO1_25 */
#define DMA12_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT4_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT0_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT2_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define CTIMER10_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER13_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define PINT7_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA14_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA018_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT1_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA020_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define CTIMER03_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER32_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER23_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define DMA017_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT6_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA10_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA13_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA021_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA016_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA18_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA03_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA07_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT5_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA04_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define CTIMER22_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER02_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER42_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define DMA013_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define CTIMER40_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define DMA06_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA010_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA16_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define CTIMER43_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER01_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER33_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define DMA11_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA022_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA01_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define FC2_CTS_SDA_SSEL0_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 1) /* PIO1_26 */
#define DMA02_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define CTIMER11_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER12_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
