zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
#define PLU5_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 7) /* PIO1_26 */
#define CTIMER20_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER00_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define DMA15_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define PINT3_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define CTIMER31_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER30_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define CTIMER21_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define DMA011_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA015_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA014_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA19_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA09_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define GPIO26_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA012_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA05_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define CTIMER41_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 3) /* PIO1_26 */
#define DMA08_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA00_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define HS_SPI_SSEL3_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 5) /* PIO1_26 */
#define UTICK01_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 4) /* PIO1_26 */
#define DMA17_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define SCT03_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 2) /* PIO1_26 */
#define DMA019_PIO1_26 IOCON_MUX(1, 26, IOCON_TYPE_D, 0) /* PIO1_26 */
#define DMA04_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA06_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define GPIO27_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA015_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA011_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define FC2_RTS_SCL_SSEL1_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 1) /* PIO1_27 */
#define DMA02_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA07_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define CTIMER03_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 3) /* PIO1_27 */
#define DMA16_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA03_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA12_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA019_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA020_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA022_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA05_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA010_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA18_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA15_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA016_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA00_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT7_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT4_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA018_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA13_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA19_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA11_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define CLKOUT_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 4) /* PIO1_27 */
#define DMA014_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT6_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA01_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA14_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA17_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA017_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA10_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT5_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define SDIF4_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 2) /* PIO1_27 */
#define PINT3_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT0_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA012_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT2_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA021_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA013_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PINT1_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define PLU4_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 7) /* PIO1_27 */
#define DMA08_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA09_PIO1_27 IOCON_MUX(1, 27, IOCON_TYPE_D, 0) /* PIO1_27 */
#define DMA014_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA14_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA019_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER31_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define DMA010_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA17_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA015_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA03_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT1_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER33_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define DMA19_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA021_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA06_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA018_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA00_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER41_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define CTIMER30_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define CTIMER21_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define PINT0_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define SDIF5_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 2) /* PIO1_28 */
#define GPIO28_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER23_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define DMA013_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT6_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER03_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define DMA05_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER11_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define DMA017_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA11_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA02_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER22_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define DMA13_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA01_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA011_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA08_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER01_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define DMA020_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER20_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define PINT2_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA18_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA012_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA10_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER12_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define CTIMER13_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define CTIMER32_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define PINT7_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA09_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER42_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define CTIMER02_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define DMA12_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA022_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA016_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA04_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA07_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER40_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define CTIMER00_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define PINT3_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER10_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define FC7_SCK_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 1) /* PIO1_28 */
#define PINT4_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define DMA15_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define CTIMER43_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 3) /* PIO1_28 */
#define PINT5_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PLU3_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 7) /* PIO1_28 */
#define DMA16_PIO1_28 IOCON_MUX(1, 28, IOCON_TYPE_D, 0) /* PIO1_28 */
#define PINT6_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA01_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define USB1_PORTPWRN_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 4) /* PIO1_29 */
#define DMA016_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA011_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define FC7_RXD_SDA_MOSI_DATA_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 1) /* PIO1_29 */
#define PLU2_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 7) /* PIO1_29 */
#define DMA021_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA14_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA08_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA16_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA00_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA13_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA012_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA014_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define USB1_FRAME_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 5) /* PIO1_29 */
#define DMA07_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA017_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA12_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA15_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define SCT04_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 3) /* PIO1_29 */
#define DMA10_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA05_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define SCT06_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 3) /* PIO1_29 */
#define DMA018_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA06_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define SCT01_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 3) /* PIO1_29 */
#define DMA010_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA020_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA09_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA03_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT2_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA17_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA02_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA013_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT0_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define GPIO29_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define SDIF6_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 2) /* PIO1_29 */
#define DMA18_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT3_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define SCT02_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT00_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT03_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT05_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 3) /* PIO1_29 */
#define PINT4_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA19_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA11_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA019_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT5_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT1_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA04_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA015_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA022_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT7_PIO1_29 IOCON_MUX(1, 29, IOCON_TYPE_D, 0) /* PIO1_29 */
#define DMA03_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define PINT7_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA09_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA07_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA010_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA020_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA019_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA018_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define USB0_PORTPWRN_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 7) /* PIO1_3 */
#define DMA11_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define SCT04_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 4) /* PIO1_3 */
#define DMA19_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA12_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA10_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA012_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA16_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define PINT1_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define PINT6_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA06_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA04_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define HS_SPI_MISO_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 6) /* PIO1_3 */
#define PLU6_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 9) /* PIO1_3 */
#define DMA02_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define PINT5_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA013_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define PINT3_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA13_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA18_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA016_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA015_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define PINT2_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA01_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA08_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA014_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA15_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA011_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA00_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA17_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA05_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define PINT4_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA017_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA14_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA022_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define PINT0_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define GPIO3_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA021_PIO1_3 IOCON_MUX(1, 3, IOCON_TYPE_D, 0) /* PIO1_3 */
#define DMA03_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA09_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define SCT04_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 3) /* PIO1_30 */
#define DMA14_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT4_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA021_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define FC7_TXD_SCL_MISO_WS_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 1) /* PIO1_30 */
#define DMA018_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA10_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA05_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT0_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA15_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA00_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA18_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define SCT06_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 3) /* PIO1_30 */
#define DMA19_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PLU1_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 7) /* PIO1_30 */
#define DMA017_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA01_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define SCT02_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 3) /* PIO1_30 */
#define PINT1_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT7_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA020_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define SCT03_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 3) /* PIO1_30 */
#define USB1_OVERCURRENTN_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 4) /* PIO1_30 */
#define DMA11_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT2_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT6_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define GPIO30_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA06_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA13_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA013_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA04_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA07_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA010_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define SDIF7_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 2) /* PIO1_30 */
#define DMA02_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA015_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define SCT01_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 3) /* PIO1_30 */
#define DMA08_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define USB1_LEDN_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 5) /* PIO1_30 */
#define DMA17_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define SCT05_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 3) /* PIO1_30 */
#define DMA16_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA014_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define SCT00_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 3) /* PIO1_30 */
#define DMA022_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT3_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT5_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA12_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA019_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA016_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA012_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA011_PIO1_30 IOCON_MUX(1, 30, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT6_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA01_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA017_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define CTIMER02_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 3) /* PIO1_31 */
#define MCLK_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 1) /* PIO1_31 */
#define PINT4_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA020_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA12_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA021_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA013_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA03_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA15_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA016_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define SD1_CLK_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 2) /* PIO1_31 */
#define DMA14_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT5_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA015_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT0_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT2_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA010_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA014_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA011_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA17_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA16_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA019_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define SCT06_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 4) /* PIO1_31 */
#define DMA13_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA018_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA07_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA02_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT3_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA012_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA05_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT7_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA04_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA10_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA022_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA19_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PLU0_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 7) /* PIO1_31 */
#define DMA00_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA08_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA18_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA09_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA11_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA06_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT1_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define GPIO31_PIO1_31 IOCON_MUX(1, 31, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA19_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA022_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA012_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA07_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
