zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC55S69JBD100-pinctrl.h
#define DMA011_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT2_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA14_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA04_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT5_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA03_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT4_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA11_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA08_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define CTIMER21_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 3) /* PIO1_4 */
#define SCT00_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 4) /* PIO1_4 */
#define GPIO4_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT0_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA15_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA014_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA16_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT7_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA02_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA01_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA016_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA12_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA09_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA17_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define SYSCONA_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 5) /* PIO1_4 */
#define DMA017_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA00_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA020_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA019_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define SDIF0_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 2) /* PIO1_4 */
#define DMA015_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA13_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA10_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT6_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA021_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT1_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA010_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define PINT3_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA013_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define FC0_SCK_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 1) /* PIO1_4 */
#define DMA18_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA018_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA05_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA06_PIO1_4 IOCON_MUX(1, 4, IOCON_TYPE_D, 0) /* PIO1_4 */
#define DMA017_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT2_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define SCT05_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 4) /* PIO1_5 */
#define DMA012_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA07_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define CTIMER20_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 3) /* PIO1_5 */
#define DMA17_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA19_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define SCT01_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 4) /* PIO1_5 */
#define DMA018_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT3_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA04_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define SDIF2_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 2) /* PIO1_5 */
#define DMA010_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define SCT06_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 4) /* PIO1_5 */
#define SCT00_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 4) /* PIO1_5 */
#define DMA014_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA019_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA08_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA15_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA016_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA14_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT7_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA09_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA18_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA11_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA00_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA011_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA12_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA05_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT4_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT6_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define FC0_RXD_SDA_MOSI_DATA_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 1) /* PIO1_5 */
#define DMA015_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT5_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA03_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT1_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA021_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define GPIO5_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA01_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define SCT03_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 4) /* PIO1_5 */
#define DMA06_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define SCT02_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 4) /* PIO1_5 */
#define SCT04_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 4) /* PIO1_5 */
#define DMA02_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA013_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA10_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA16_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA13_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA022_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT0_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define DMA020_PIO1_5 IOCON_MUX(1, 5, IOCON_TYPE_D, 0) /* PIO1_5 */
#define PINT4_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT7_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA011_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA05_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA03_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define SDIF3_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 2) /* PIO1_6 */
#define DMA12_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA010_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA01_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA02_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define GPIO6_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define CTIMER21_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 3) /* PIO1_6 */
#define DMA10_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA08_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define SCT03_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 4) /* PIO1_6 */
#define DMA019_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA14_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT2_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define SCT02_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 4) /* PIO1_6 */
#define DMA11_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA022_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA014_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT5_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define SCT01_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 4) /* PIO1_6 */
#define PINT3_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define SCT06_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 4) /* PIO1_6 */
#define DMA017_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA13_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT6_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA07_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA19_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT0_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA16_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define SCT04_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 4) /* PIO1_6 */
#define SCT05_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 4) /* PIO1_6 */
#define DMA18_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA04_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA00_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA013_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA012_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA15_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA018_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA016_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA06_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA17_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA020_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define FC0_TXD_SCL_MISO_WS_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 1) /* PIO1_6 */
#define DMA09_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define SCT00_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 4) /* PIO1_6 */
#define DMA021_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA015_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define PINT1_PIO1_6 IOCON_MUX(1, 6, IOCON_TYPE_D, 0) /* PIO1_6 */
#define DMA12_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA019_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define GPIO7_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA09_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT0_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA10_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA022_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA020_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA14_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT4_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA13_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA02_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT3_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA012_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT2_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA03_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define SCT01_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 4) /* PIO1_7 */
#define DMA013_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA021_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define FC0_RTS_SCL_SSEL1_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 1) /* PIO1_7 */
#define SCT02_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 4) /* PIO1_7 */
#define DMA19_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define SCT04_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 4) /* PIO1_7 */
#define CTIMER22_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 3) /* PIO1_7 */
#define DMA016_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA011_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT6_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA04_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA16_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA15_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA017_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA01_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA07_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA05_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define SCT05_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 4) /* PIO1_7 */
#define PINT1_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA08_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA010_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT5_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA06_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define SDIF1_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 2) /* PIO1_7 */
#define DMA17_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA11_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define SCT06_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 4) /* PIO1_7 */
#define SCT00_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 4) /* PIO1_7 */
#define DMA18_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA00_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define SCT03_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 4) /* PIO1_7 */
#define DMA014_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA015_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA018_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define PINT7_PIO1_7 IOCON_MUX(1, 7, IOCON_TYPE_D, 0) /* PIO1_7 */
#define DMA014_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA18_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define SCT01_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 4) /* PIO1_8 */
#define DMA13_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA011_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA022_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define GPIO8_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA013_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define SD0_CLK_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 2) /* PIO1_8 */
#define DMA017_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define PINT2_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define PINT1_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define FC0_CTS_SDA_SSEL0_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 1) /* PIO1_8 */
#define DMA10_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA09_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA19_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define PINT3_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA06_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define PINT6_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA020_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA018_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA16_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define PINT5_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA17_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA010_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA15_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA08_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA14_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define PINT0_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA01_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA04_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA019_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA12_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA07_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA11_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA03_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA021_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA00_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA02_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA015_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA05_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA012_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA016_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define FC4_SSEL2_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 5) /* PIO1_8 */
#define PINT7_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define PINT4_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define ADC04_PIO1_8 IOCON_MUX(1, 8, IOCON_TYPE_A, 0) /* PIO1_8 */
#define DMA012_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA09_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA17_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define GPIO9_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA011_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA015_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA022_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA016_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA13_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA08_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define FC1_SCK_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 2) /* PIO1_9 */
#define CTIMER10_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define CTIMER02_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define PINT5_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define PINT4_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define PINT7_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER11_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA11_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER40_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA017_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define ADC012_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA013_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA06_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA14_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA014_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER20_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA12_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define PINT2_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define PINT0_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER23_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define CTIMER12_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA19_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA019_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER03_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA01_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA10_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER30_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define PINT1_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER43_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA16_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA00_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA18_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER31_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA018_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER21_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define CTIMER41_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define CTIMER32_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define CTIMER13_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA021_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER01_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA15_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA03_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define FC4_CTS_SDA_SSEL0_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 5) /* PIO1_9 */
#define DMA05_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA04_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA02_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER33_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA010_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define DMA07_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER22_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define DMA020_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define CTIMER42_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define PINT6_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */
#define SCT02_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 4) /* PIO1_9 */
#define CTIMER00_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 3) /* PIO1_9 */
#define PINT3_PIO1_9 IOCON_MUX(1, 9, IOCON_TYPE_A, 0) /* PIO1_9 */

#endif
